{
    "blockedPage": {
        "time": "of",
        "job": "Frontend Developer",
        "openPage": "Click to unlock",
        "toggleBlocked": "Locked",
        "toggleOpen": "Unlocked"
    },

    "homePage": {
        "about": "About me",
        "cv": "CV",
        "calendar": "Calendar",
        "design": "Graphic Design",
        "gallery": "Random Gallery",
        "projects": "Projects",
        "miniprojects": "Miniprojects",
        "cookies": "Cookies",
        "ethics": "Ethics",
        "socials": "Socials",
        "contact": "Contact"
    },

    "aboutPage": {
        "title": "Hello! I'm Maria Guglielmone",
        "subtitle": "Frontend Developer",
        "content": {
            "img1": {
                "text": "Hello! I'm Maria Guglielmone Ventura, but you can call me 'Gugli.' This nickname started in high school when a classmate could never pronounce my last name correctly, and it stuck as a personal label. The truth is, I love it now, but it wasn't always the case.",
                "date": "April 23, 2023"
            },
            "img2": {
                "text": "I have a degree in Audiovisual Communication from Jaume I University in Castellon (Spain). This year, I completed the postgraduate program in Web Development and Design at ESAT, Valencia.",
                "date": "April 30, 2023"
            },
            "img3": {
                "text": "I did my internship during my career at a communication agency in Valencia: Eva Montesinos Comunicación. After that, I continued as a freelance photographer for music groups in Valencia and also delved into the world of design. Thanks to my year as a freelancer in Valencia, I became interested in the ID3 postgraduate program at ESAT, and now I am a web developer with a lot of creativity.",
                "date": "May 10, 2023"
            },
            "img4": {
                "text": "Through my postgraduate program, I've had the opportunity to delve deeper into the multifaceted realm of web development. As a junior frontend developer, I've acquired a diverse skill set that encompasses tools and technologies, which include: Figma, CSS and HTML, WordPress, PHP, Javascript, React, Vite, API integration, CSS Frameworks (Bootstrap), CSS Preprocessors (SCSS), responsive design and web accesibility, package managers (npm) and a little of testing.",
                "date": "May 16, 2023"
            },
            "img5": {
                "text": "I've lived my entire life in Castellón (Spain), but two years ago, I moved to Valencia. In this city, I've found a second family that has supported me during these years. Now, I'm seeking a new adventure and I'm open to whatever the future holds for me.",
                "date": "May 20, 2023"
            },
            "img6": {
                "text": "I love to travel and discover as much as I can during my journeys. I'm a curious person, and that doesn't change professionally. Transitioning from a photographer to a web developer was a challenging yet immensely enjoyable process. As a junior, I continue to learn new things every day.",
                "date": "May 22, 2023"
            },
            "img7": {
                "text": "I'm seeking a job as a junior frontend developer. My passion lies in css, but I'm not afraid to embark on new adventures.",
                "date": "May 27, 2023"
            },
            "img8": {
                "text": "In the future, I hope to continue working as a developer while also keeping photography in my life. I feel that once I learn something, there's always a part of it that stays with me.",
                "date": "May 31, 2023"
            },
            "img9": {
                "text": "Actually, I'm not very consistent on social media. But I'm working on it, as with everything in life, you have to keep trying.",
                "date": "Jun 2, 2023"
            }
        }
    },

    "galleryPage": {
        "title": "Random Gallery",
        "subtitle": "I'm also photographer",
        "all": "All",
        "roma": "Rome",
        "mateomorral": "Mateo Morral",
        "concerts": "Concerts",
        "meseta": "Meseta",
        "polaroids": "Polaroids",
        "summer": "Summer",
        "claudia": "Claudia"
    },

    "designPage": {
        "title": "Graphic Design",
        "menu": {
            "roots": "Roots",
            "letterSoup": "Alphabet Soup",
            "dontCry": "Don't cry for the flowers",
            "genkoa": "Genkoa"
        },
        "content": {
            "roots": "ROOTS",
            "letterSoup": "Sometimes I feel like my head is made up of a alphabet soup on which I keep discovering new words.",
            "dontCry": "Don't cry for the flowers - an invitation to a party. Letters designed by me.",
            "genkoa": "Poster and logo for Genkoa's project."
        }
    },

    "projects": {
        "aboutMe": {
            "title": "AboutMe",
            "description": "AboutMe was my first project as a web designer and developer. It's a 'one page' based on information about me where you can get to know me a little better.",
            "btn": "See project"
        },
        "genkoa": {
            "title": "Genkoa",
            "description": "Genkoa is a project carried out for the youth film association 'La Simulación.' Genkoa arises from the idea of connecting future artists so that they can develop their art and have their own projects to showcase when seeking their first jobs. It is an initiative to CONNECT ART within the Valencian Community.",
            "btn": "See project"
        },
        "portfolio": {
            "title": "Portfolio",
            "description": "Gugli is my portfolio, this very website! On it, I have showcased all my most recent knowledge in an organic way, simulating mobile 'apps.' It has been entirely created by me, from the design process to the development of the website using React.",
            "btn": "Back to the beginning"
        }
    },

    "contactPage": {
        "title": "Messages",
        "message": {
            "ms1": "Hello! What do you need?", 
            "ms2":"Don't hesitate to contact me if you want to collaborate with me. 🙆‍♀️", 
            "ms3":"I am a junior front-end developer with a strong desire to continue learning and expanding my knowledge."
        },
        "form": {
            "label": {
                "name": "Name",
                "email": "Email",
                "message": "Message"
            },
            "placeholder": {
                "name": "Write your name",
                "email": "Write your email here",
                "message": "Tell me what you need"
            },
            "btn": "Submit"
        }
    },

    "ethicPage": {
        "title": "Ethical Standards",
        "intro": "Welcome to my ethics page, where I share my principles and values as a frontend developer. As a professional in this field, I believe that ethics play a fundamental role in our work and how we interact with our clients and users.",
        "commitment": {
            "title": "Ethical Commitment",
            "text": "Throughout my career as a junior frontend developer, I've established a strong commitment to ethics in my work. I believe that honesty, integrity, and transparency are paramount in any project. My ethical principles include:",
            "list": {
                "quality": {
                    "name": "Quality",
                    "definition": "I strive to deliver high-quality work to my clients and end-users. Every line of code and design undergoes rigorous quality control."
                },
                "userCentric": {
                    "name": "User-Centric Approach",
                    "definition": "My primary focus is the user. I consider them the most important clients, and my work is dedicated to enhancing their experience. All my designs and developments are geared towards providing an exceptional user experience."
                },
                "communication": {
                    "name": "Clear Communication",
                    "definition": "I maintain open and honest communication with my clients and collaborators. Transparency at every stage of a project is essential in building strong, trust-based relationships."
                },
                "privacy": {
                    "name": "Privacy and Security",
                    "definition": "I address data privacy and security concerns with the utmost seriousness. I always ensure that user data is protected and handled ethically."
                },
                "sustainability": {
                    "name": "Sustainability",
                    "definition": "I consider sustainability in my projects and practice sustainable web development whenever possible. Contributing to environmental responsibility is a responsibility I take seriously."
                },
                "diversity": {
                    "name": "Diversity and Inclusion",
                    "definition": "I actively support diversity and inclusion in the tech industry. I believe in equal opportunities for all."
                }
            }

        },
        "example": {
            "title": "Practical Examples",
            "text": "Throughout my career, I've applied these ethical principles in concrete projects. You can explore examples and case studies in my portfolio that demonstrate how my ethical approach has benefited my clients and users."
        },
        "codeConduct": {
            "title": "Code of Conduct",
            "text": "I follow a professional and ethical code of conduct in all my interactions and collaborations. This code is based on respect, collaboration, and professional ethics."
        },
        "contact": {
            "title": "Contact",
            "text": "If you wish to discuss any aspect of my ethics or how I apply them in my work as a frontend developer, please feel free to contact me. You can send me a message directly at: info.mariagugli@gmail.com."
        },
        "toSum": "I appreciate your interest in my ethical approach, and I hope this page provides you with a deeper understanding of my values and principles as a frontend professional."
        
    },

    "cookiesPage": {
        "title": "Cookies",
        "update": "Last Updated: 06/07/2023",
        "intro": "This Cookie Policy explains the use of cookies on our portfolio website. By using our website, you agree to the use of cookies in accordance with this policy.",
        "explainCookie": {
            "title": "What are Cookies?",
            "text": "Cookies are small text files that are placed on your computer or mobile device when you visit a website. They may be used for various purposes, including enhancing your online experience and providing essential functionality."
        },
        "useCookies": {
            "title": "How We Use Cookies",
            "text": "We use cookies on our portfolio website for the following purposes:",
            "list": {
                "essencial": {
                    "title": "Essential Cookies",
                    "description": "These cookies are necessary for the proper functioning of our website. They enable you to navigate our site, access secure areas, and use essential features like our contact form."
                },
                "analytical": {
                    "title": "Analytical/Performance Cookies",
                    "description": "We may use cookies to collect anonymous information about how visitors interact with our website. This data helps us improve our site's performance and user experience."
                }
            }
        },
        "choices": {
            "title": "Your Choices Regarding Cookies",
            "text": "You can choose to accept or decline cookies. Most web browsers automatically accept cookies, but you can usually modify your browser settings to decline cookies if you prefer. Please note that disabling cookies may affect your ability to use certain features of our website, including the contact form."
        },
        "contactForm": {
            "title": "Contact Form",
            "text": "When you use our contact form, we collect the following information:",
            "list": {
                "name": "Name",
                "email": "Email",
                "message": "Message"
            },
            "description": "We use this information solely to respond to your inquiry and provide you with the requested information or assistance. We do not use this information for any other purpose, and we do not share it with third parties."
        },
        "updatesPolicy": {
            "title": "Updates to this Policy",
            "text": "We may update this Cookie Policy from time to time. Please check this page periodically for any updates."
        },
        "contact": {
            "title": "Contact Us",
            "text": "If you have any questions about our Cookie Policy or how we use cookies on our website, please contact us at: info.mariagugli@gmail.com"
        }

    },

    "errorPage": {
        "subtitle": "We're sorry, we're working on this page.",
        "explain": "Right now, this content cannot be displayed. Please try again later; we are working to improve this portfolio.",
        "newPath": "If you want to know more about me or my work:",
        "btnContact": "Let's talk :)",
        "btnAbout": "Know more about me",
        "thanks": "Thanks!🌷"
    },

    "generalParts": {
        "notification": {
            "work": {
                "text": "I am available to work.",
                "btn": "Contact me"
            },
            "weather": {
                "placeholder": "Search any city",
                "humidity": "Humidity",
                "windSpeed": "Wind Speed"
            }
        },
        "popup": {
            "form": {
                "success": "Perfect! I've received your message in my email.",
                "fail": "Hello, something has occurred, and the delivery couldn't be completed. Please try again later. Or send me a message directly at: info.mariagugli@gmail.com"
            }
        },
        "docs": {
            "cv": "/GuglielmoneMariaCV__EN.pdf"
        }
    }
}