{
    "blockedPage": {
        "time": "de",
        "job": "Desarrolladora web",
        "openPage": "Click para desbloquear",
        "toggleBlocked": "Bloqueado",
        "toggleOpen": "Desbloqueado"
    },

    "homePage": {
        "about": "Sobre mi",
        "cv": "CV",
        "calendar": "Agenda",
        "design": "Diseño gráfico",
        "gallery": "Galería",
        "projects": "Proyectos",
        "miniprojects": "Miniproyectos",
        "cookies": "Cookies",
        "ethics": "Ética",
        "socials": "Redes",
        "contact": "Contacto"
    },

    "aboutPage": {
        "title": "Hola! Soy Maria Guglielmone",
        "subtitle": "Desarolladora Frontend",
        "content": {
            "img1": {
                "text": "Hola! Soy Maria Guglielmone Ventura, pero podéis llamarte 'Gugli'. Este mote empezó en el instituto cuando un compañero no sabía nunca decir mi apellido bien y se quedó como sello personal. La verdad es que ahora me encanta pero no siempre fue así.",
                "date": "23 abril 2023"
            },
            "img2": {
                "text": "estoy graduada en Comunicación Audiovisual por la Universidad Jaume I, en Castellón. Este año, he finalizado el postgrado de Desarrollo y Diseño Web en la ESAT, Valencia.",
                "date": "30 de abril 2023"
            },
            "img3": {
                "text": "Realicé las prácticas de mi carrera en una agencia de comunicación de Valencia: Eva Montesinos Comunicación. Tras eso seguí como fotógrafa freelance para grupos de música en Valencia y también me adentré en el mundo del diseño. Gracias a mi año como freelance en Valencia, terminé interesandome por el postgrado de ID3 de ESAT y ahora soy una desarrolladora web con mucha creatividad.",
                "date": "10 de mayo 2023"
            },
            "img4": {
                "text": "Gracias a mi programa de postgrado, he tenido la oportunidad de profundizar aún más en el multifacético mundo del desarrollo web. Como desarrollador frontend junior, he adquirido un conjunto diverso de habilidades que abarcan herramientas y tecnologías, que incluyen: 'Figma', CSS y HTML, WordPress, PHP, Javascript, React, Vite, integración de API, Frameworks de CSS (Bootstrap), preprocesadores de CSS (SCSS), diseño receptivo y accesibilidad web, gestores de paquetes (npm) y un poco de testing.",
                "date": "16 de mayo 2023"
            },
            "img5": {
                "text": "He vivido toda mi vida en Castellón, pero hace dos años me fui a vivir a Valencia. En esta ciudad he conocido a una segunda familia que me ha ayudado estos años. Ahora estoy buscando una nueva aventura y no me importa el destino que me depare.",
                "date": "20 de mayo 2023"
            },
            "img6": {
                "text": "Me encanta viajar y descubrir todo lo que me sea posible en mis viajes. Soy una persona curiosa y eso no cambia profesionalmente. Pasar de fotógrafa a desarrolladora web fue un proceso duro pero muy entretenido. Y sigo disfrutando aprendiendo nuevas cosas cada día como junior.",
                "date": "22 de mayo 2023"
            },
            "img7": {
                "text": "Busco un trabajo como front-end developer junior. Lo que más me gusta es la maquetación, pero no tengo miedo a embarcarme en nuevas aventuras.",
                "date": "27 de mayo 2023"
            },
            "img8": {
                "text": "En el futuro espero seguir trabajando como desarrolladora pero sin dejar de lado a la fotografía. Siento que una vez aprendo algo, siempre hay una parte de ello que se queda conmigo.",
                "date": "31 de mayo 2023"
            },
            "img9": {
                "text": "En realidad, no soy muy constante en redes sociales. Pero estoy en ello, como todo en la vida, hay que seguir intentándolo.",
                "date": "2 de junio 2023"
            }
        }
    },

    "galleryPage": {
        "title": "Galería Aleatoria",
        "subtitle": "También soy fotógrafa",
        "all": "Todas",
        "roma": "Roma",
        "mateomorral": "Mateo Morral",
        "concerts": "Conciertos",
        "meseta": "Meseta",
        "polaroids": "Polaroids",
        "summer": "Verano",
        "claudia": "Claudia"
    },

    "designPage": {
        "title": "Diseño Gráfico",
        "menu": {
            "roots": "Raíces",
            "letterSoup": "Sopa de letras",
            "dontCry": "No llores por las flores",
            "genkoa": "Genkoa"
        },
        "content": {
            "roots": "RAICES",
            "letterSoup": "A veces siento que mi cabeza se compone de una sopa de letras sobre la que sigo descubriendo nuevas palabras.",
            "dontCry": "No llores por las flores - invitación a una fiesta. Letras diseñadas por mi.",
            "genkoa": "Cartel y logo para el proyecto Genkoa."
        }
    },

    "projects": {
        "aboutMe": {
            "title": "AboutMe",
            "description": "AboutMe fue mi primer proyecto como diseñadora y desarrolladora web. Es un 'one page' basado en información sobre mi donde puedes conocerme un poco más.",
            "btn": "Ver proyecto"
        },
        "genkoa": {
            "title": "Genkoa",
            "description": "Genkoa es un proyecto realizado para la asociación cinematográfica juvenil La Simulación. Genkoa surge de la idea de conectar a futuros artistas para que puedan desarrollar su arte y tener proyectos propios que poder mostrar a la hora de buscar sus primeros trabajos. Es una iniciativa para CONECTAR ARTE dentro de la Comunidad Valencia.",
            "btn": "Ver proyecto"
        },
        "portfolio": {
            "title": "Portfolio",
            "description": "Gugli es mi portfolio, ¡esta misma página web! En ella he explotado todos mis más recientes conocimientos en una forma orgánica, simulando 'apps' de un móvil. Ha sido completamente creado por mi, desde el proceso de diseño hasta el desarrollo de la página con React.",
            "btn": "Volver a la pantalla de inicio"
        }
    },

    "contactPage": {
        "title": "Mensajes",
        "message": {
            "ms1": "Hola! Qué necesitas?",
            "ms2": "No dudes en contactarme si quieres colaborar conmigo. 🙆‍♀️",
            "ms3": "Soy una front-end developer junior con muchas ganas de seguir aprendiendo y desarrollando mis conocimientos."
        },
        "form": {
            "label": {
                "name": "Nombre",
                "email": "Correo",
                "message": "Mensaje"
            },
            "placeholder": {
                "name": "Escríbeme tu nombre",
                "email": "Escribe aquí tu correo",
                "message": "Cuéntame qué necesitas"
            },
            "btn": "Enviar"
        }
    },

    "ethicPage": {
        "title": "Estándares de ética",
        "intro": "Bienvenido a mi página de ética, donde compartiré mis principios y valores como desarrollador frontend. Como profesional en este campo, considero que la ética desempeña un papel fundamental en nuestra labor y en cómo interactuamos con nuestros clientes y usuarios.",
        "commitment": {
            "title": "Compromiso Ético",
            "text": "A lo largo de mi carrera como desarrollador frontend junior, he establecido un firme compromiso con la ética en mi trabajo. Creo que la honestidad, la integridad y la transparencia son fundamentales en cualquier proyecto. Mis principios éticos incluyen:",
            "list": {
                "quality": {
                    "name": "Calidad",
                    "definition": "Me esfuerzo por entregar trabajos de alta calidad a mis clientes y usuarios finales. Cada línea de código y cada diseño se someten a un riguroso control de calidad."
                },
                "userCentric": {
                    "name": "Usuario-Centrismo",
                    "definition": "Mi enfoque principal es el usuario. Creo que son los clientes más importantes, y mi trabajo se centra en mejorar su experiencia. Todos mis diseños y desarrollos están orientados a ofrecer una experiencia excepcional al usuario."
                },
                "communication": {
                    "name": "Comunicación Clara",
                    "definition": "Mantengo una comunicación abierta y honesta con mis clientes y colaboradores. La transparencia en todas las etapas de un proyecto es esencial para construir relaciones sólidas y de confianza."
                },
                "privacy": {
                    "name": "Privacidad y Seguridad",
                    "definition": "Abordo las preocupaciones de privacidad y seguridad de los datos con la máxima seriedad. Siempre me esfuerzo por garantizar que los datos de los usuarios estén protegidos y manejados de manera ética."
                },
                "sustainability": {
                    "name": "Sostenibilidad",
                    "definition": "Considero la sostenibilidad en mis proyectos y practico el desarrollo web sostenible siempre que sea posible. Contribuir al cuidado del medio ambiente es una responsabilidad que tomo en serio."
                },
                "diversity": {
                    "name": "Diversidad e Inclusión",
                    "definition": "Apoyo activamente la diversidad y la inclusión en la industria tecnológica. Creo en la igualdad de oportunidades para todos."
                }
            }

        },
        "example": {
            "title": "Ejemplos Prácticos",
            "text": "A lo largo de mi carrera, he aplicado estos principios éticos en proyectos concretos. Puedes explorar ejemplos y casos de estudio en mi portafolio que demuestran cómo mi enfoque ético ha beneficiado a mis clientes y usuarios."
        },
        "codeConduct": {
            "title": "Código de Conducta",
            "text": "Sigo un código de conducta profesional y ético en todas mis interacciones y colaboraciones. Este código se basa en el respeto, la colaboración y la ética profesional."
        },
        "contact": {
            "title": "Contacto",
            "text": "Si deseas discutir cualquier aspecto de mi ética o cómo la aplico en mi trabajo como desarrollador frontend, no dudes en contactarme. Puedes enviarme un mensaje directamente a: info.mariagugli@gmail.com."
        },
        "toSum": "Agradezco tu interés en mi enfoque ético y espero que esta página te brinde una comprensión más profunda de mis valores y principios como profesional frontend."
        
    },

    "cookiesPage": {
        "title": "Cookies",
        "update": "Última actualización: 06/07/2023",
        "intro": "Esta Política de Cookies explica el uso de cookies en nuestro sitio web de portfolio. Al utilizar nuestro sitio web, aceptas el uso de cookies de acuerdo con esta política.",
        "explainCookie": {
            "title": "¿Qué son las Cookies?",
            "text": "Las cookies son pequeños archivos de texto que se colocan en tu ordenador o dispositivo móvil cuando visitas un sitio web. Pueden utilizarse para diversos fines, incluyendo mejorar tu experiencia en línea y proporcionar funcionalidad esencial."
        },
        "useCookies": {
            "title": "Cómo Usamos las Cookies",
            "text": "Utilizamos cookies en nuestro sitio web de portafolio con los siguientes propósitos:",
            "list": {
                "essencial": {
                    "title": "Cookies Esenciales",
                    "description": "Estas cookies son necesarias para el correcto funcionamiento de nuestro sitio web. Te permiten navegar por nuestro sitio, acceder a áreas seguras y utilizar funciones esenciales como nuestro formulario de contacto."
                },
                "analytical": {
                    "title": "Cookies Analíticas/Rendimiento",
                    "description": "Podemos utilizar cookies para recopilar información anónima sobre cómo los visitantes interactúan con nuestro sitio web. Estos datos nos ayudan a mejorar el rendimiento de nuestro sitio y la experiencia del usuario."
                }
            }
        },
        "choices": {
            "title": "Tus opciones en relación con las Cookies",
            "text": "Puedes optar por aceptar o rechazar las cookies. La mayoría de los navegadores web aceptan automáticamente las cookies, pero generalmente puedes modificar la configuración de tu navegador para rechazar las cookies si lo prefieres. Ten en cuenta que desactivar las cookies puede afectar tu capacidad para utilizar ciertas funciones de nuestro sitio web, incluyendo el formulario de contacto."
        },
        "contactForm": {
            "title": "Formulario de Contacto",
            "text": "Cuando utilizas nuestro formulario de contacto, recopilamos la siguiente información:",
            "list": {
                "name": "Nombre",
                "email": "Email",
                "message": "Mensaje"
            },
            "description": "Utilizamos esta información exclusivamente para responder a tu consulta y proporcionarte la información o la asistencia solicitada. No utilizamos esta información para ningún otro propósito y no la compartimos con terceros."
        },
        "updatesPolicy": {
            "title": "Actualizaciones de la política",
            "text": "Podemos actualizar esta Política de Cookies periódicamente. Consulta esta página de vez en cuando para conocer cualquier actualización."
        },
        "contact": {
            "title": "Contáctanos",
            "text": "Si tienes alguna pregunta sobre nuestra Política de Cookies o sobre cómo utilizamos las cookies en nuestro sitio web, contáctanos en: info.mariagugli@gmail.com"
        }

    },

    "errorPage": {
        "subtitle": "Lo siento estamos trabajando en esta página",
        "explain": "Ahora mismo este contenido no puede mostrarse. Intenta volver más tarde, estamos trabajando para mejorar este portfolio.",
        "newPath": "Si quieres seguir saber más sobre mi o mis trabajos:",
        "btnContact": "Hablemos :)",
        "btnAbout": "Conóceme más",
        "thanks": "Gracias!🌷"
    },

    "generalParts": {
        "notification": {
            "work": {
                "text": "Estoy disponible para trabajar.",
                "btn": "Contáctame"
            },
            "weather": {
                "placeholder": "Busca una ciudad",
                "humidity": "Humedad",
                "windSpeed": "Velocidad del viento"
            }
        },
        "popup": {
            "form": {
                "success": "Perfecto! He recibido tu mensaje en mi correo.",
                "fail": "Hola, algo ha ocurrido y no se ha podido completar el envío. Inténtalo más tarde. O envíame un mensaje directamente a: info.mariagugli@gmail.com"
            }
        },
        "docs": {
            "cv": "/GuglielmoneMariaCV__ES.pdf"
        }
        
    }
}